Revit 2027 API
IFCParameterTemplate.SetActiveTemplate Method
 Sets the mapping template element to be the active mapping template for its document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetActiveTemplate()
Public Sub SetActiveTemplate
public:
void SetActiveTemplate()
member SetActiveTemplate : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  Invalid use of in-session template.
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace